# Расчетная сумма финансирования в год ежегодно:
#
year_sum = 347000000  # руб
# Максимальное количество диагностики, проведенной хозспособом:
#
hossposobom = 1000
# 1000 шт (по экспертному мнению)
# Стоимость проведения работ:
#
# Диагностика:
diagn_1 = 36377.01  # ₽
# Паспорт:
passport = 14079.77  # ₽
# ЭПБ:
EPB = 15503.92  # ₽

# Ориентировочное требуемое количество первичных экспертиз:
# 2400
# Распределение по годам (дополнительно к вторичным):
# 2024: 800 шт
# 2025: 800 шт
# 2026: 800 шт

# Стоимость экспертиз:
# Первичная экспертиза: 65 960,70 ₽ (Диагностика + Паспорт + ЭПБ)
# Вторичная экспертиза: 51 880,93 ₽ (Диагностика + ЭПБ)
# Потребность в проведении ТО/ВТО:
#
# Примерно 3000 ТУ в год
# Цена:
TU_price = 15085.92  # ₽

scenario_2023 = [0.1706, 0.3279, 0.2416, 0.241995, 0.24300, 0.24092, 0.24065, 0.24148]

# год ЭПБ	1	2	3	4	5	6	7	8
epb_hist = {2017: [450, 463, 624, 760, 150, 0, 0, 0],
            2018: [852, 834, 671, 394, 74, 0, 0, 2750],
            2019: [357, 2997, 2457, 1844, 546, 0, 0, 0],
            2020: [211, 1270, 2815, 1426, 1776, 0, 0, 0],
            2021: [911, 3804, 3290, 669, 429, 0, 0, 0],
            2022: [885, 2821, 2069, 513, 222, 0, 0, 0],
            2023: [1621, 3115, 2295, 1895, 285, 87, 62, 141]}

def raspred_po_procents(p1, p2, p3, p4, p5, p6, p7, p8, n):
    pps = [p1, p2, p3, p4, p5, p6, p7, p8]
    raspred =[0,0,0,0,0,0,0,0]
    for i, pp in enumerate(pps):
        pp_n = round(n*pp)
        if n<pp_n:
            raspred[i] = n
            n = 0
        else:
            raspred[i] = pp_n
            n = n-pp_n
    return raspred






def calc_future_prolongs(p1, p2, p3, p4, p5, p6, p7, p8, hossposobom):
    for history_year in range(2017, 2030 + 1):
        if not history_year in epb_hist:
            epb_hist[history_year] = [0,0,0,0,0,0,0,0]
        # надо разбить по процентам
        prodlenia_from_history_year = raspred_po_procents(p1, p2, p3, p4, p5, p6, p7, p8, n)

